l993889589/STM32/projects/stm32h563-h5/STM32H563RIV6_app/user/bsp/bsp_uart.c
/**
 * @file bsp_uart.c
 * @brief UART initialization, STM32 hardware control, interrupts, and public BSP API.
 */


#include <stdint.h>

#include "bsp_uart.h"
#include "stm32h5xx_hal.h"
#include "bsp_cache.h"

/** @brief Static runtime context owned by exactly one logical board UART role. */
typedef struct
{
    UART_HandleTypeDef handle;
    DMA_HandleTypeDef rx_dma;
    bsp_uart_port_t port;
    uint8_t use_dma;
    uint8_t cache_invalidate;
    uint8_t rx_byte_mode;
    uint8_t is_initialized;
    uint8_t rx_dma_initialized;
    volatile uint8_t stop_wakeup_event;
    uint8_t *rx_buffer;
    uint16_t rx_size;
    uint8_t rx_byte;
    bsp_uart_rx_cb_t rx_callback;
    void *rx_argument;
    bsp_uart_health_t health;
} bsp_uart_hw_context_t;

/**
 * @brief Initialize one context-owned STM32H5 UART handle.
 * @param context Static context owned by the board role.
 * @param port Logical role used when reporting callbacks.
 * @param instance STM32 UART peripheral instance selected by the board.
 * @param baud_rate Requested UART baud rate in bits per second.
 * @param use_dma Nonzero selects ReceiveToIdle DMA; zero selects interrupt reception.
 * @param cache_invalidate Nonzero invalidates D-cache before delivering DMA data.
 * @return Zero on success, otherwise -1.
 */
int bsp_uart_hw_init(bsp_uart_hw_context_t *context,
                  bsp_uart_port_t port,
                  USART_TypeDef *instance,
                  uint32_t baud_rate,
                  uint8_t use_dma,
                  uint8_t cache_invalidate);

/**
 * @brief Configure and link a context-owned GPDMA receive channel.
 * @param context Initialized UART context.
 * @param instance GPDMA channel selected by the board binding.
 * @param request GPDMA request selector for the UART receive signal.
 * @return Zero on success, otherwise -1.
 */
int bsp_uart_hw_configure_rx_dma(bsp_uart_hw_context_t *context,
                              DMA_Channel_TypeDef *instance,
                              uint32_t request);

/**
 * @brief Query whether the context has an active DMA receive binding.
 * @param context Initialized UART context.
 * @return One when DMA reception is usable, otherwise zero.
 */
uint8_t bsp_uart_hw_rx_uses_dma(const bsp_uart_hw_context_t *context);

/**
 * @brief Register the receive owner callback for one UART context.
 * @param context Initialized UART context.
 * @param callback Callback invoked from interrupt context; NULL disables delivery.
 * @param argument Caller-owned argument with static service lifetime.
 * @return Zero on success, otherwise -1.
 */
int bsp_uart_hw_register_rx_callback(bsp_uart_hw_context_t *context,
                                  bsp_uart_rx_cb_t callback,
                                  void *argument);

/**
 * @brief Start ReceiveToIdle reception into caller-owned storage.
 * @param context Initialized UART context.
 * @param buffer Receive buffer valid for the active reception lifetime.
 * @param length Buffer length in bytes.
 * @return Zero on success, otherwise -1.
 */
int bsp_uart_hw_start_rx(bsp_uart_hw_context_t *context, uint8_t *buffer, uint16_t length);

/**
 * @brief Start single-byte ReceiveToIdle reception using context-owned storage.
 * @param context Initialized UART context.
 * @return Zero on success, otherwise -1.
 */
int bsp_uart_hw_start_rx_byte(bsp_uart_hw_context_t *context);

/**
 * @brief Transmit bytes with a bounded timeout.
 * @param context Initialized UART context.
 * @param data Transmit buffer valid until the call returns.
 * @param length Byte count.
 * @param timeout_ms Maximum blocking time in milliseconds.
 * @return Transmitted byte count on success, otherwise -1.
 */
int bsp_uart_hw_write(bsp_uart_hw_context_t *context,
                   const uint8_t *data,
                   uint16_t length,
                   uint32_t timeout_ms);

/**
 * @brief Wait until the final UART stop bit has completed transmission.
 * @param context Initialized UART context.
 * @param timeout_ms Maximum wait in milliseconds.
 * @return Zero on success, otherwise -1.
 */
int bsp_uart_hw_wait_tx_complete(bsp_uart_hw_context_t *context, uint32_t timeout_ms);

/**
 * @brief Copy UART health counters from one initialized context.
 * @param context Initialized UART context.
 * @param health Destination snapshot.
 * @return Zero on success, otherwise -1.
 */
int bsp_uart_hw_get_health(const bsp_uart_hw_context_t *context, bsp_uart_health_t *health);

/** @brief Suspend receive and arm start-bit wakeup for a Stop-capable UART. */
int bsp_uart_hw_prepare_stop_wakeup(bsp_uart_hw_context_t *context);

/** @brief Leave UART Stop mode and restore the previously owned reception. */
int bsp_uart_hw_resume_after_stop(bsp_uart_hw_context_t *context);

/** @brief Consume the UART wake-event latch set by the HAL ISR callback. */
uint8_t bsp_uart_hw_take_stop_wakeup_event(bsp_uart_hw_context_t *context);

/**
 * @brief Dispatch one UART vector to the context-owned HAL handle.
 * @param context Initialized UART context.
 * @note ISR context only.
 */
void bsp_uart_hw_irq_from_isr(bsp_uart_hw_context_t *context);

/**
 * @brief Dispatch one receive-DMA vector to the context-owned HAL DMA handle.
 * @param context UART context with an initialized receive DMA channel.
 * @note ISR context only.
 */
void bsp_uart_hw_rx_dma_irq_from_isr(bsp_uart_hw_context_t *context);


#include "bsp_uart.h"

#include <stddef.h>

#include "bsp_config.h"

/** @brief Physical UART, IRQ, and receive-DMA resources for one logical role. */
typedef struct
{
    bsp_uart_port_t port;
    USART_TypeDef *instance;
    uint32_t baud_rate;
    uint8_t use_dma;
    uint8_t cache_invalidate;
    IRQn_Type uart_irq;
    uint32_t uart_irq_priority;
    DMA_Channel_TypeDef *rx_dma_instance;
    uint32_t rx_dma_request;
    IRQn_Type rx_dma_irq;
    uint32_t rx_dma_irq_priority;
} bsp_uart_binding_t;

static bsp_uart_hw_context_t g_bsp_uart_contexts[BSP_UART_COUNT];
static uint8_t g_bsp_uart_initialized;

static const bsp_uart_binding_t g_bsp_uart_bindings[BSP_UART_COUNT] =
{
    [BSP_UART_W800_AT] = {
        BSP_UART_W800_AT,
        BOARD_UART_W800_INSTANCE,
        BOARD_UART_DEFAULT_BAUD_RATE,
        BOARD_UART_W800_RX_DMA_ENABLED,
        BOARD_UART_W800_RX_DMA_CACHE_INVALIDATE,
        BOARD_UART_W800_IRQ,
        BOARD_UART_W800_IRQ_PRIORITY,
        BOARD_UART_W800_RX_DMA_INSTANCE,
        BOARD_UART_W800_RX_DMA_REQUEST,
        BOARD_UART_W800_RX_DMA_IRQ,
        BOARD_UART_W800_RX_DMA_IRQ_PRIORITY
    },
    [BSP_UART_RS485_1] = {
        BSP_UART_RS485_1,
        BOARD_UART_RS485_1_INSTANCE,
        BOARD_UART_DEFAULT_BAUD_RATE,
        BOARD_UART_RS485_1_RX_DMA_ENABLED,
        BOARD_UART_RS485_1_RX_DMA_CACHE_INVALIDATE,
        BOARD_UART_RS485_1_IRQ,
        BOARD_UART_RS485_1_IRQ_PRIORITY,
        BOARD_UART_RS485_1_RX_DMA_INSTANCE,
        BOARD_UART_RS485_1_RX_DMA_REQUEST,
        BOARD_UART_RS485_1_RX_DMA_IRQ,
        BOARD_UART_RS485_1_RX_DMA_IRQ_PRIORITY
    },
    [BSP_UART_RS485_2] = {
        BSP_UART_RS485_2,
        BOARD_UART_RS485_2_INSTANCE,
        BOARD_UART_DEFAULT_BAUD_RATE,
        BOARD_UART_RS485_2_RX_DMA_ENABLED,
        BOARD_UART_RS485_2_RX_DMA_CACHE_INVALIDATE,
        BOARD_UART_RS485_2_IRQ,
        BOARD_UART_RS485_2_IRQ_PRIORITY,
        BOARD_UART_RS485_2_RX_DMA_INSTANCE,
        BOARD_UART_RS485_2_RX_DMA_REQUEST,
        BOARD_UART_RS485_2_RX_DMA_IRQ,
        BOARD_UART_RS485_2_RX_DMA_IRQ_PRIORITY
    },
    [BSP_UART_DEBUG] = {
        BSP_UART_DEBUG,
        BOARD_UART_DEBUG_INSTANCE,
        BOARD_UART_DEFAULT_BAUD_RATE,
        BOARD_UART_DEBUG_RX_DMA_ENABLED,
        BOARD_UART_DEBUG_RX_DMA_CACHE_INVALIDATE,
        BOARD_UART_DEBUG_IRQ,
        BOARD_UART_DEBUG_IRQ_PRIORITY,
        BOARD_UART_DEBUG_RX_DMA_INSTANCE,
        BOARD_UART_DEBUG_RX_DMA_REQUEST,
        BOARD_UART_DEBUG_RX_DMA_IRQ,
        BOARD_UART_DEBUG_RX_DMA_IRQ_PRIORITY
    },
};

/** @brief Configure one board-selected UART signal pin. */
static void bsp_uart_configure_pin(GPIO_TypeDef *port,
                                     uint32_t pin,
                                     uint32_t alternate,
                                     uint32_t pull,
                                     uint32_t speed)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = pin;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = pull;
    gpio.Speed = speed;
    gpio.Alternate = alternate;
    HAL_GPIO_Init(port, &gpio);
}

/** @brief Resolve one logical role to its statically owned MCU context. */
static bsp_uart_hw_context_t *bsp_uart_get_context(bsp_uart_port_t port)
{
    return port < BSP_UART_COUNT ? &g_bsp_uart_contexts[port] : NULL;
}

/** @brief Configure kernel clock, GPIO alternate functions, and peripheral clock for one role. */
static int bsp_uart_configure_hardware(const bsp_uart_binding_t *binding)
{
    RCC_PeriphCLKInitTypeDef peripheral_clock = {0};

    if(binding == NULL)
        return -1;

    switch(binding->port)
    {
        case BSP_UART_W800_AT:
            peripheral_clock.PeriphClockSelection = RCC_PERIPHCLK_USART1;
            peripheral_clock.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
            if(HAL_RCCEx_PeriphCLKConfig(&peripheral_clock) != HAL_OK)
                return -1;

            __HAL_RCC_USART1_CLK_ENABLE();
            __HAL_RCC_GPIOA_CLK_ENABLE();
            __HAL_RCC_GPDMA1_CLK_ENABLE();
            bsp_uart_configure_pin(BOARD_UART_W800_TX_PORT,
                                     BOARD_UART_W800_TX_PIN,
                                     BOARD_UART_W800_TX_AF,
                                     BOARD_UART_W800_TX_PULL,
                                     BOARD_UART_W800_TX_SPEED);
            bsp_uart_configure_pin(BOARD_UART_W800_RX_PORT,
                                     BOARD_UART_W800_RX_PIN,
                                     BOARD_UART_W800_RX_AF,
                                     BOARD_UART_W800_RX_PULL,
                                     BOARD_UART_W800_RX_SPEED);
            break;

        case BSP_UART_RS485_1:
            peripheral_clock.PeriphClockSelection = RCC_PERIPHCLK_USART2;
            peripheral_clock.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
            if(HAL_RCCEx_PeriphCLKConfig(&peripheral_clock) != HAL_OK)
                return -1;

            __HAL_RCC_USART2_CLK_ENABLE();
            __HAL_RCC_GPIOA_CLK_ENABLE();
            bsp_uart_configure_pin(BOARD_UART_RS485_1_TX_PORT,
                                     BOARD_UART_RS485_1_TX_PIN,
                                     BOARD_UART_RS485_1_TX_AF,
                                     BOARD_UART_RS485_1_TX_PULL,
                                     BOARD_UART_RS485_1_TX_SPEED);
            bsp_uart_configure_pin(BOARD_UART_RS485_1_RX_PORT,
                                     BOARD_UART_RS485_1_RX_PIN,
                                     BOARD_UART_RS485_1_RX_AF,
                                     BOARD_UART_RS485_1_RX_PULL,
                                     BOARD_UART_RS485_1_RX_SPEED);
            break;

        case BSP_UART_RS485_2:
            peripheral_clock.PeriphClockSelection = RCC_PERIPHCLK_UART4;
            peripheral_clock.Uart4ClockSelection = RCC_UART4CLKSOURCE_PCLK1;
            if(HAL_RCCEx_PeriphCLKConfig(&peripheral_clock) != HAL_OK)
                return -1;

            __HAL_RCC_UART4_CLK_ENABLE();
            __HAL_RCC_GPIOA_CLK_ENABLE();
            bsp_uart_configure_pin(BOARD_UART_RS485_2_TX_PORT,
                                     BOARD_UART_RS485_2_TX_PIN,
                                     BOARD_UART_RS485_2_TX_AF,
                                     BOARD_UART_RS485_2_TX_PULL,
                                     BOARD_UART_RS485_2_TX_SPEED);
            bsp_uart_configure_pin(BOARD_UART_RS485_2_RX_PORT,
                                     BOARD_UART_RS485_2_RX_PIN,
                                     BOARD_UART_RS485_2_RX_AF,
                                     BOARD_UART_RS485_2_RX_PULL,
                                     BOARD_UART_RS485_2_RX_SPEED);
            break;

        case BSP_UART_DEBUG:
            peripheral_clock.PeriphClockSelection = RCC_PERIPHCLK_USART3;
            peripheral_clock.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
            if(HAL_RCCEx_PeriphCLKConfig(&peripheral_clock) != HAL_OK)
                return -1;

            __HAL_RCC_USART3_CLK_ENABLE();
            __HAL_RCC_GPIOC_CLK_ENABLE();
            bsp_uart_configure_pin(BOARD_UART_DEBUG_TX_PORT,
                                     BOARD_UART_DEBUG_TX_PIN,
                                     BOARD_UART_DEBUG_TX_AF,
                                     BOARD_UART_DEBUG_TX_PULL,
                                     BOARD_UART_DEBUG_TX_SPEED);
            bsp_uart_configure_pin(BOARD_UART_DEBUG_RX_PORT,
                                     BOARD_UART_DEBUG_RX_PIN,
                                     BOARD_UART_DEBUG_RX_AF,
                                     BOARD_UART_DEBUG_RX_PULL,
                                     BOARD_UART_DEBUG_RX_SPEED);
            break;

        default:
            return -1;
    }

