l993889589/STM32/projects/stm32h563-h5/STM32H563RIV6_app/user/bsp/bsp_uart.c
    return 0;
}

/** @brief Configure NVIC ownership after the UART and optional DMA handles are ready. */
static void bsp_uart_enable_interrupts(const bsp_uart_binding_t *binding)
{
    HAL_NVIC_SetPriority(binding->uart_irq, binding->uart_irq_priority, 0U);
    HAL_NVIC_EnableIRQ(binding->uart_irq);

    if(binding->rx_dma_instance != NULL)
    {
        HAL_NVIC_SetPriority(binding->rx_dma_irq, binding->rx_dma_irq_priority, 0U);
        HAL_NVIC_EnableIRQ(binding->rx_dma_irq);
    }
}

/** @brief Initialize every logical role from the current board resource table. */
int bsp_uart_init(void)
{
    if(g_bsp_uart_initialized != 0U)
        return 0;

    for(uint32_t index = 0U;
        index < (sizeof(g_bsp_uart_bindings) / sizeof(g_bsp_uart_bindings[0]));
        index++)
    {
        const bsp_uart_binding_t *binding = &g_bsp_uart_bindings[index];
        bsp_uart_hw_context_t *context = bsp_uart_get_context(binding->port);

        if(bsp_uart_configure_hardware(binding) != 0 ||
           bsp_uart_hw_init(context,
                         binding->port,
                         binding->instance,
                         binding->baud_rate,
                         binding->use_dma,
                         binding->cache_invalidate) != 0)
        {
            return -1;
        }

        if(binding->rx_dma_instance != NULL &&
           bsp_uart_hw_configure_rx_dma(context,
                                     binding->rx_dma_instance,
                                     binding->rx_dma_request) != 0)
        {
            return -1;
        }

        bsp_uart_enable_interrupts(binding);
    }

    g_bsp_uart_initialized = 1U;
    return 0;
}

/** @brief Implement bsp_uart_rx_uses_dma() through the role-owned context. */
uint8_t bsp_uart_rx_uses_dma(bsp_uart_port_t port)
{
    return bsp_uart_hw_rx_uses_dma(bsp_uart_get_context(port));
}

/** @brief Implement receive callback registration through the board role. */
int bsp_uart_register_rx_callback(bsp_uart_port_t port,
                                  bsp_uart_rx_cb_t callback,
                                  void *argument)
{
    return bsp_uart_hw_register_rx_callback(bsp_uart_get_context(port),
                                         callback,
                                         argument);
}

/** @brief Implement caller-buffer ReceiveToIdle start through the board role. */
int bsp_uart_start_rx(bsp_uart_port_t port, uint8_t *buffer, uint16_t length)
{
    return bsp_uart_hw_start_rx(bsp_uart_get_context(port), buffer, length);
}

/** @brief Implement byte-wise ReceiveToIdle start through the board role. */
int bsp_uart_start_rx_byte(bsp_uart_port_t port)
{
    return bsp_uart_hw_start_rx_byte(bsp_uart_get_context(port));
}

/** @brief Arm the board-selected UART role as a Stop wake source. */
int bsp_uart_prepare_stop_wakeup(bsp_uart_port_t port)
{
    return bsp_uart_hw_prepare_stop_wakeup(bsp_uart_get_context(port));
}

/** @brief Restore the board-selected UART role after Stop mode. */
int bsp_uart_resume_after_stop(bsp_uart_port_t port)
{
    return bsp_uart_hw_resume_after_stop(bsp_uart_get_context(port));
}

/** @brief Consume one board-selected UART wake event. */
uint8_t bsp_uart_take_stop_wakeup_event(bsp_uart_port_t port)
{
    return bsp_uart_hw_take_stop_wakeup_event(bsp_uart_get_context(port));
}

/** @brief Implement bounded UART transmit through the board role. */
int bsp_uart_write(bsp_uart_port_t port,
                   const uint8_t *data,
                   uint16_t length,
                   uint32_t timeout_ms)
{
    return bsp_uart_hw_write(bsp_uart_get_context(port), data, length, timeout_ms);
}

/** @brief Implement transmit plus final-stop-bit completion through the board role. */
int bsp_uart_write_wait_complete(bsp_uart_port_t port,
                                 const uint8_t *data,
                                 uint16_t length,
                                 uint32_t timeout_ms)
{
    bsp_uart_hw_context_t *context = bsp_uart_get_context(port);
    int written = bsp_uart_hw_write(context, data, length, timeout_ms);

    if(written < 0 || bsp_uart_hw_wait_tx_complete(context, timeout_ms) != 0)
        return -1;

    return written;
}

/** @brief Return the receive-event counter for one logical role. */
uint32_t bsp_uart_rx_events(bsp_uart_port_t port)
{
    bsp_uart_health_t health;

    return bsp_uart_hw_get_health(bsp_uart_get_context(port), &health) == 0 ?
           health.rx_events : 0U;
}

/** @brief Implement health snapshot retrieval through the board role. */
int bsp_uart_get_health(bsp_uart_port_t port, bsp_uart_health_t *health)
{
    return bsp_uart_hw_get_health(bsp_uart_get_context(port), health);
}

/** @brief Dispatch one UART vector by logical role without exposing HAL handles. */
void bsp_uart_irq_from_isr(bsp_uart_port_t port)
{
    bsp_uart_hw_irq_from_isr(bsp_uart_get_context(port));
}

/** @brief Dispatch one receive-DMA vector by logical role without exposing DMA handles. */
void bsp_uart_rx_dma_irq_from_isr(bsp_uart_port_t port)
{
    bsp_uart_hw_rx_dma_irq_from_isr(bsp_uart_get_context(port));
}

/* STM32 hardware implementation. */

#include <stddef.h>
#include <string.h>

#include "bsp_cache.h"

#define MCU_UART_CONTEXT_COUNT (BSP_UART_COUNT)

static bsp_uart_hw_context_t *g_uart_contexts[MCU_UART_CONTEXT_COUNT];

/** @brief Resolve a HAL UART handle to its statically registered owner. */
static bsp_uart_hw_context_t *bsp_uart_hw_find(UART_HandleTypeDef *handle)
{
    for(uint32_t index = 0U; index < MCU_UART_CONTEXT_COUNT; index++)
    {
        if(g_uart_contexts[index] != NULL && &g_uart_contexts[index]->handle == handle)
            return g_uart_contexts[index];
    }

    return NULL;
}

/** @brief Register one static context for centralized HAL callback dispatch. */
static int bsp_uart_hw_register_context(bsp_uart_hw_context_t *context)
{
    for(uint32_t index = 0U; index < MCU_UART_CONTEXT_COUNT; index++)
    {
        if(g_uart_contexts[index] == context)
            return 0;

        if(g_uart_contexts[index] == NULL)
        {
            g_uart_contexts[index] = context;
            return 0;
        }
    }

    return -1;
}

