l993889589/STM32/projects/stm32h563-h5/STM32H563RIV6_app/user/bsp/bsp_uart.c
/** @brief Restart the configured ReceiveToIdle operation after an event or error. */
static int bsp_uart_hw_restart_rx(bsp_uart_hw_context_t *context)
{
    HAL_StatusTypeDef status;

    if(context == NULL || context->is_initialized == 0U ||
       context->rx_buffer == NULL || context->rx_size == 0U)
    {
        return -1;
    }

    if(context->use_dma != 0U)
    {
        if(context->rx_dma_initialized == 0U)
            return -1;

        /* DMA owns the complete receive buffer until the next Rx event. */
        if((context->cache_invalidate != 0U) &&
           (bsp_cache_invalidate(context->rx_buffer, context->rx_size) != BSP_STATUS_OK))
        {
            context->health.rx_cache_errors++;
            return -1;
        }

        status = HAL_UARTEx_ReceiveToIdle_DMA(&context->handle,
                                             context->rx_buffer,
                                             context->rx_size);
        if(status == HAL_OK && context->handle.hdmarx != NULL)
            __HAL_DMA_DISABLE_IT(context->handle.hdmarx, DMA_IT_HT);
    }
    else
    {
        status = HAL_UARTEx_ReceiveToIdle_IT(&context->handle,
                                            context->rx_buffer,
                                            context->rx_size);
    }

    if(status != HAL_OK)
        return -1;

    context->health.rx_restarts++;
    return 0;
}

/** @brief Implement bsp_uart_hw_init() as documented by its private interface. */
int bsp_uart_hw_init(bsp_uart_hw_context_t *context,
                  bsp_uart_port_t port,
                  USART_TypeDef *instance,
                  uint32_t baud_rate,
                  uint8_t use_dma,
                  uint8_t cache_invalidate)
{
    if(context == NULL || instance == NULL || port >= BSP_UART_COUNT || baud_rate == 0U)
        return -1;

    if(context->is_initialized != 0U)
        return context->handle.Instance == instance ? 0 : -1;

    memset(context, 0, sizeof(*context));
    context->port = port;
    context->use_dma = use_dma != 0U ? 1U : 0U;
    context->cache_invalidate = cache_invalidate != 0U ? 1U : 0U;
    context->handle.Instance = instance;
    context->handle.Init.BaudRate = baud_rate;
    context->handle.Init.WordLength = UART_WORDLENGTH_8B;
    context->handle.Init.StopBits = UART_STOPBITS_1;
    context->handle.Init.Parity = UART_PARITY_NONE;
    context->handle.Init.Mode = UART_MODE_TX_RX;
    context->handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    context->handle.Init.OverSampling = UART_OVERSAMPLING_16;
    context->handle.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    context->handle.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    context->handle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if(HAL_UART_Init(&context->handle) != HAL_OK ||
       HAL_UARTEx_SetTxFifoThreshold(&context->handle, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK ||
       HAL_UARTEx_SetRxFifoThreshold(&context->handle, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK ||
       HAL_UARTEx_DisableFifoMode(&context->handle) != HAL_OK)
    {
        return -1;
    }

    if(bsp_uart_hw_register_context(context) != 0)
        return -1;

    context->is_initialized = 1U;
    return 0;
}

/** @brief Implement context-owned receive DMA setup for an initialized UART. */
int bsp_uart_hw_configure_rx_dma(bsp_uart_hw_context_t *context,
                              DMA_Channel_TypeDef *instance,
                              uint32_t request)
{
    if(context == NULL || context->is_initialized == 0U ||
       context->use_dma == 0U || instance == NULL)
    {
        return -1;
    }

    context->rx_dma.Instance = instance;
    context->rx_dma.Init.Request = request;
    context->rx_dma.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
    context->rx_dma.Init.Direction = DMA_PERIPH_TO_MEMORY;
    context->rx_dma.Init.SrcInc = DMA_SINC_FIXED;
    context->rx_dma.Init.DestInc = DMA_DINC_INCREMENTED;
    context->rx_dma.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_BYTE;
    context->rx_dma.Init.DestDataWidth = DMA_DEST_DATAWIDTH_BYTE;
    context->rx_dma.Init.Priority = DMA_LOW_PRIORITY_LOW_WEIGHT;
    context->rx_dma.Init.SrcBurstLength = 1U;
    context->rx_dma.Init.DestBurstLength = 1U;
    context->rx_dma.Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT0;
    context->rx_dma.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
    context->rx_dma.Init.Mode = DMA_NORMAL;

    if(HAL_DMA_Init(&context->rx_dma) != HAL_OK ||
       HAL_DMA_ConfigChannelAttributes(&context->rx_dma, DMA_CHANNEL_NPRIV) != HAL_OK)
    {
        return -1;
    }

    __HAL_LINKDMA(&context->handle, hdmarx, context->rx_dma);
    context->rx_dma_initialized = 1U;
    return 0;
}

/** @brief Implement bsp_uart_hw_rx_uses_dma() as documented by its private interface. */
uint8_t bsp_uart_hw_rx_uses_dma(const bsp_uart_hw_context_t *context)
{
    if(context == NULL || context->is_initialized == 0U ||
       context->rx_dma_initialized == 0U || context->handle.hdmarx == NULL)
    {
        return 0U;
    }

    return context->use_dma;
}

/** @brief Implement callback registration for one initialized UART context. */
int bsp_uart_hw_register_rx_callback(bsp_uart_hw_context_t *context,
                                  bsp_uart_rx_cb_t callback,
                                  void *argument)
{
    if(context == NULL || context->is_initialized == 0U)
        return -1;

    context->rx_callback = callback;
    context->rx_argument = argument;
    return 0;
}

/** @brief Implement bsp_uart_hw_start_rx() as documented by its private interface. */
int bsp_uart_hw_start_rx(bsp_uart_hw_context_t *context, uint8_t *buffer, uint16_t length)
{
    if(context == NULL || context->is_initialized == 0U || buffer == NULL || length == 0U)
        return -1;

    if((context->use_dma != 0U) && (context->cache_invalidate != 0U) &&
       (bsp_cache_is_line_aligned(buffer, length) == 0U))
    {
        context->health.rx_alignment_errors++;
        return -1;
    }

    context->rx_buffer = buffer;
    context->rx_size = length;
    context->rx_byte_mode = 0U;
    return bsp_uart_hw_restart_rx(context);
}

/** @brief Implement bsp_uart_hw_start_rx_byte() as documented by its private interface. */
int bsp_uart_hw_start_rx_byte(bsp_uart_hw_context_t *context)
{
    if(context == NULL || context->is_initialized == 0U)
        return -1;

    context->rx_buffer = &context->rx_byte;
    context->rx_size = 1U;
    context->rx_byte_mode = 1U;
    return bsp_uart_hw_restart_rx(context);
}

/** @brief Implement bounded blocking transmit for one UART context. */
int bsp_uart_hw_write(bsp_uart_hw_context_t *context,
                   const uint8_t *data,
                   uint16_t length,
                   uint32_t timeout_ms)
{
    if(context == NULL || context->is_initialized == 0U || data == NULL || length == 0U)
        return -1;

    if(HAL_UART_Transmit(&context->handle, (uint8_t *)data, length, timeout_ms) != HAL_OK)
    {
        context->health.tx_errors++;
        return -1;
    }

    context->health.tx_bytes += length;
    return (int)length;
}

