l993889589/STM32/projects/stm32h563-h5/STM32H563RIV6_app/user/bsp/bsp_uart.c
/** @brief Implement final-stop-bit completion wait for one UART context. */
int bsp_uart_hw_wait_tx_complete(bsp_uart_hw_context_t *context, uint32_t timeout_ms)
{
    uint32_t start_ms;

    if(context == NULL || context->is_initialized == 0U)
        return -1;

    start_ms = HAL_GetTick();
    while(__HAL_UART_GET_FLAG(&context->handle, UART_FLAG_TC) == RESET)
    {
        if(timeout_ms != HAL_MAX_DELAY && (HAL_GetTick() - start_ms) > timeout_ms)
        {
            context->health.tx_errors++;
            return -1;
        }
    }

    return 0;
}

/** @brief Implement bsp_uart_hw_get_health() as documented by its private interface. */
int bsp_uart_hw_get_health(const bsp_uart_hw_context_t *context, bsp_uart_health_t *health)
{
    if(context == NULL || context->is_initialized == 0U || health == NULL)
        return -1;

    *health = context->health;
    return 0;
}

/** @brief Stop current reception and select start-bit wakeup on USART1. */
int bsp_uart_hw_prepare_stop_wakeup(bsp_uart_hw_context_t *context)
{
    UART_WakeUpTypeDef wakeup = {0};

    if((context == NULL) || (context->is_initialized == 0U) ||
       (context->handle.Instance != USART1))
    {
        return -1;
    }

    (void)HAL_UART_AbortReceive(&context->handle);
    context->stop_wakeup_event = 0U;
    wakeup.WakeUpEvent = UART_WAKEUP_ON_STARTBIT;
    if(HAL_UARTEx_StopModeWakeUpSourceConfig(&context->handle, wakeup) != HAL_OK)
    {
        return -1;
    }
    __HAL_UART_CLEAR_FLAG(&context->handle, UART_CLEAR_WUF);
    __HAL_UART_ENABLE_IT(&context->handle, UART_IT_WUF);
    return HAL_UARTEx_EnableStopMode(&context->handle) == HAL_OK ? 0 : -1;
}

/** @brief Disable UART Stop mode and restart the owned ReceiveToIdle transfer. */
int bsp_uart_hw_resume_after_stop(bsp_uart_hw_context_t *context)
{
    if((context == NULL) || (context->is_initialized == 0U) ||
       (context->handle.Instance != USART1))
    {
        return -1;
    }

    if(__HAL_UART_GET_FLAG(&context->handle, UART_FLAG_WUF) != RESET)
    {
        context->stop_wakeup_event = 1U;
    }
    __HAL_UART_DISABLE_IT(&context->handle, UART_IT_WUF);
    if(HAL_UARTEx_DisableStopMode(&context->handle) != HAL_OK)
    {
        return -1;
    }
    __HAL_UART_CLEAR_FLAG(&context->handle, UART_CLEAR_WUF);
    return bsp_uart_hw_restart_rx(context);
}

/** @brief Atomically consume one UART Stop-wakeup callback latch. */
uint8_t bsp_uart_hw_take_stop_wakeup_event(bsp_uart_hw_context_t *context)
{
    uint32_t primask;
    uint8_t event;

    if(context == NULL)
    {
        return 0U;
    }
    primask = __get_PRIMASK();
    __disable_irq();
    event = context->stop_wakeup_event;
    context->stop_wakeup_event = 0U;
    if(primask == 0U)
    {
        __enable_irq();
    }
    return event;
}

/** @brief Dispatch one UART vector to its context-owned HAL handle. */
void bsp_uart_hw_irq_from_isr(bsp_uart_hw_context_t *context)
{
    if(context != NULL && context->is_initialized != 0U)
        HAL_UART_IRQHandler(&context->handle);
}

/** @brief Dispatch one receive-DMA vector to its context-owned HAL DMA handle. */
void bsp_uart_hw_rx_dma_irq_from_isr(bsp_uart_hw_context_t *context)
{
    if(context != NULL && context->rx_dma_initialized != 0U)
        HAL_DMA_IRQHandler(&context->rx_dma);
}

/** @brief Route one HAL ReceiveToIdle event to its registered UART owner. */
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *handle, uint16_t size)
{
    bsp_uart_hw_context_t *context = bsp_uart_hw_find(handle);

    if(context == NULL)
        return;

    if(size > context->rx_size)
        size = context->rx_size;

    context->health.rx_events++;
    context->health.rx_bytes += size;

    if(size != 0U && context->rx_buffer != NULL)
    {
        if(context->cache_invalidate != 0U)
        {
            if(bsp_cache_invalidate(context->rx_buffer,
                                    (uint32_t)((size + BSP_CACHE_LINE_SIZE - 1U) &
                                               ~(BSP_CACHE_LINE_SIZE - 1U))) != BSP_STATUS_OK)
            {
                context->health.rx_cache_errors++;
                context->health.rx_errors++;
                size = 0U;
            }
        }

        if(context->rx_callback != NULL)
        {
            context->rx_callback(context->port,
                                 context->rx_buffer,
                                 size,
                                 context->rx_argument);
        }
    }

    if(bsp_uart_hw_restart_rx(context) != 0)
    {
        context->health.rx_restart_errors++;
        context->health.rx_errors++;
    }
}

/** @brief Record a HAL UART error and restart the owned ReceiveToIdle operation. */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *handle)
{
    bsp_uart_hw_context_t *context = bsp_uart_hw_find(handle);

    if(context == NULL)
        return;

    context->health.rx_errors++;
    if(bsp_uart_hw_restart_rx(context) != 0)
    {
        context->health.rx_restart_errors++;
        context->health.rx_errors++;
    }
}

/** @brief Latch a Stop-mode UART wakeup without using RTOS services in the ISR. */
void HAL_UARTEx_WakeupCallback(UART_HandleTypeDef *handle)
{
    bsp_uart_hw_context_t *context = bsp_uart_hw_find(handle);

    if(context != NULL)
    {
        context->stop_wakeup_event = 1U;
    }
}
